Same issue for me reproducible on 1.2 and 1.3.  Noticed this after we upgraded to 15.0.1 Build 0.0.11.  

1.) It shows it is going to apply with destination port *:8200, but applies it with default
2.) The next plan/apply shows it needs to change it *:8200, but then fails when trying to correct it.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # bigip_ltm_monitor.foo will be created
  + resource "bigip_ltm_monitor" "foo" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = (known after apply)
      + destination    = "*:8200"
      + id             = (known after apply)
      + interval       = 3
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/monitor_foo"
      + parent         = "/Common/https"
      + receive        = "200\\sOK"
      + reverse        = (known after apply)
      + send           = "GET /v1/sys/health HTTP/1.1\\r\\nHost: foo.bar.com\\r\\nConnection: close\\r\\n\\r\\n"
      + time_until_up  = (known after apply)
      + timeout        = 5
      + transparent    = (known after apply)
    }

  # bigip_ltm_pool.pool_foo_8200 will be updated in-place
  ~ resource "bigip_ltm_pool" "pool_foo_8200" {
        allow_nat           = "yes"
        allow_snat          = "yes"
        id                  = "/Common/pool_foo_8200"
        load_balancing_mode = "round-robin"
      ~ monitors            = [
          - "",
          + "/Common/monitor_foo",
        ]
        name                = "/Common/pool_foo_8200"
        reselect_tries      = 0
        service_down_action = "none"
        slow_ramp_time      = 0
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions in workspace "prod"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_monitor.foo: Creating...
bigip_ltm_monitor.foo: Creation complete after 1s [id=/Common/monitor_foo]
bigip_ltm_pool.pool_foo_8200: Modifying... [id=/Common/pool_foo_8200]
bigip_ltm_pool.pool_foo_8200: Modifications complete after 1s [id=/Common/pool_foo_8200]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.foo_generic_secret.svc-f5-automation: Refreshing state...
bigip_ltm_monitor.foo: Refreshing state... [id=/Common/monitor_foo]
bigip_ltm_node.nodes[1]: Refreshing state... [id=/Common/ussl-foop02.bar.com]
bigip_ltm_node.nodes[2]: Refreshing state... [id=/Common/ussl-foop03.bar.com]
bigip_ltm_node.nodes[0]: Refreshing state... [id=/Common/ussl-foop01.bar.com]
bigip_ltm_pool.pool_foo_8200: Refreshing state... [id=/Common/pool_foo_8200]
bigip_ltm_pool_attachment.pool_foo_8200[0]: Refreshing state... [id=/Common/pool_foo_8200-/Common/ussl-foop01.bar.com:8200]
bigip_ltm_pool_attachment.pool_foo_8200[2]: Refreshing state... [id=/Common/pool_foo_8200-/Common/ussl-foop03.bar.com:8200]
bigip_ltm_pool_attachment.pool_foo_8200[1]: Refreshing state... [id=/Common/pool_foo_8200-/Common/ussl-foop02.bar.com:8200]
bigip_ltm_virtual_server.https: Refreshing state... [id=/Common/vs_prod-foo_https]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # bigip_ltm_monitor.foo will be updated in-place
  ~ resource "bigip_ltm_monitor" "foo" {
        adaptive       = "disabled"
        adaptive_limit = 200
      ~ destination    = "*:*" -> "*:8200"
        id             = "/Common/monitor_foo"
        interval       = 3
        ip_dscp        = 0
        manual_resume  = "disabled"
        name           = "/Common/monitor_foo"
        parent         = "/Common/https"
        receive        = "200\\sOK"
        reverse        = "disabled"
        send           = "GET /v1/sys/health HTTP/1.1\\r\\nHost: foo.bar.com\\r\\nConnection: close\\r\\n\\r\\n"
        time_until_up  = 0
        timeout        = 5
        transparent    = "disabled"
    }

Plan: 0 to add, 1 to change, 0 to destroy.


########### Next plan/apply ###########

terraform apply
data.foo_generic_secret.svc-f5-automation: Refreshing state...
bigip_ltm_monitor.foo: Refreshing state... [id=/Common/monitor_foo]
bigip_ltm_node.nodes[1]: Refreshing state... [id=/Common/ussl-foop02.bar.com]
bigip_ltm_node.nodes[0]: Refreshing state... [id=/Common/ussl-foop01.bar.com]
bigip_ltm_node.nodes[2]: Refreshing state... [id=/Common/ussl-foop03.bar.com]
bigip_ltm_pool.pool_foo_8200: Refreshing state... [id=/Common/pool_foo_8200]
bigip_ltm_pool_attachment.pool_foo_8200[1]: Refreshing state... [id=/Common/pool_foo_8200-/Common/ussl-foop02.bar.com:8200]
bigip_ltm_pool_attachment.pool_foo_8200[0]: Refreshing state... [id=/Common/pool_foo_8200-/Common/ussl-foop01.bar.com:8200]
bigip_ltm_pool_attachment.pool_foo_8200[2]: Refreshing state... [id=/Common/pool_foo_8200-/Common/ussl-foop03.bar.com:8200]
bigip_ltm_virtual_server.https: Refreshing state... [id=/Common/vs_prod-foo_https]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # bigip_ltm_monitor.foo will be updated in-place
  ~ resource "bigip_ltm_monitor" "foo" {
        adaptive       = "disabled"
        adaptive_limit = 200
      ~ destination    = "*:*" -> "*:8200"
        id             = "/Common/monitor_foo"
        interval       = 3
        ip_dscp        = 0
        manual_resume  = "disabled"
        name           = "/Common/monitor_foo"
        parent         = "/Common/https"
        receive        = "200\\sOK"
        reverse        = "disabled"
        send           = "GET /v1/sys/health HTTP/1.1\\r\\nHost: foo.bar.com\\r\\nConnection: close\\r\\n\\r\\n"
        time_until_up  = 0
        timeout        = 5
        transparent    = "disabled"
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions in workspace "prod"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_monitor.foo: Modifying... [id=/Common/monitor_foo]

Error: HTTP 400 :: {"code":400,"message":"\"compatibility\" invalid value \"none\", expected one of the following: \"disabled\" \"enabled\" ","errorStack":[],"apiError":26214401}

  on monitors.tf line 1, in resource "bigip_ltm_monitor" "foo":
   1: resource "bigip_ltm_monitor" "foo" {


Releasing state lock. This may take a few moments...

